Конфигурация/Documents/ПоручениеНаДвижениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиВозвратаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводВсехАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоручениеНаПереводМеждуСчетамиДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетНДФЛПайщиков</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПоручениеНаДвижениеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьДекорацийСогласованияПорученияНаВыводАктивов(ЭтаФорма);

	ЗаполнитьПодтверждениеОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	Оповестить("СогласованиеПоручений.Обновить");
	Оповестить("ИсполнениеПоручений.Обновить");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	Если Не (ЗначениеЗаполнено(ЭтаФорма.ВидПоручения) Или Объект.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите вид поручения",,, "ВидПоручения", Отказ);
			
	КонецЕсли;
					
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
		
	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные",
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РассчитатьДатуОкончанияИсполнения();
		
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = 0;
	КонецЕсли; 
	
	Если ЭтаФорма.ИсточникПоручения = 1 Тогда
	
		Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
		
		УстановитьТекстКонтрагентаДоговора();
		
		Если ЭтаФорма.ВидПоручения = 2 И ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			
			ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам = ПолучитьДанныеИзНастроекУчетаДоходовПоЦеннымБумагам(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Валюта);
			
			Объект.РасчетныйСчет = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.РасчетныйСчет;
			Объект.Валюта = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.Валюта;
			
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.ИсточникПоручения = 2 Тогда
		
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			
			ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам = ПолучитьДанныеИзНастроекУчетаДоходовПоЦеннымБумагам(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Валюта);
			
			Объект.РасчетныйСчет = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.РасчетныйСчет;
			Объект.Валюта = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.Валюта;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)
		
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	Объект.ПоручениеНаПереводМеждуСчетамиДУ = (ЭтаФорма.ТипПередачи = 1);
	
	УстановитьТекстКонтрагентаДоговора();
	
	ОбработатьРасчетныеСчетаПриИзмененииКонтрагента();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПолучательПриИзменении(Элемент)
	
	ОбработатьРасчетныеСчетаПриИзмененииКонтрагента();
	УстановитьТекстКонтрагентаДоговора();	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОтправительПриИзменении(Элемент)
	
	ОбработатьРасчетныеСчетаПриИзмененииКонтрагента();
	УстановитьТекстКонтрагентаДоговора();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПорученияПриИзменении(Элемент)
	 	
	Если ЭтаФорма.ВидПоручения = 3 Тогда
		
		// Определим предыдущее значение переключателя
		Если Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская") Тогда
			ПредЗначениеВидПоручения = 1;
		ИначеЕсли Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская") Тогда
			ПредЗначениеВидПоручения = 2;
		Иначе
			ПредЗначениеВидПоручения = 0;
		КонецЕсли;
		
		Если Вопрос("При установке флага 'Вывод всех активов' будут очищены:
					|	Сумма,
					|	Валюта.
					|Продолжить?",
					РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
						
			Объект.ВыводВсехАктивов = Истина;		
			Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская");
			Объект.ПоручениеНаПереводМеждуСчетамиДУ = Ложь;
	
		Иначе
			ЭтаФорма.ВидПоручения = ПредЗначениеВидПоручения;
			Возврат;
		КонецЕсли;
	
	Иначе
		
		Объект.ВыводВсехАктивов        = Ложь;
		Объект.РасчетныйСчетПолучатель = Неопределено;

		Если ЭтаФорма.ВидПоручения = 1 Тогда
			
			Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская");
			Объект.РасчетныйСчет    = Неопределено;
			
		ИначеЕсли ЭтаФорма.ВидПоручения = 2 Тогда 	
			
			Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская");
			
			Если ЭтаФорма.ИсточникПоручения = 1 И ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			
				ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам = ПолучитьДанныеИзНастроекУчетаДоходовПоЦеннымБумагам(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Валюта);
				
				Объект.РасчетныйСчет = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.РасчетныйСчет;
				Объект.Валюта = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.Валюта;
				
			КонецЕсли;
	
		КонецЕсли;
					
	КонецЕсли;
	
	ТипПередачиПриИзменении(Неопределено);

	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель.Видимость Тогда		
		КомандаВыбратьИсполнителяПоДенежнымСредствам(Неопределено);
	Иначе		
		КомандаВыбратьДанныеПоКонтрагенту(Неопределено);
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамОтправитель.Видимость Тогда		
		КомандаВыбратьИсполнителяПоДенежнымСредствам(Неопределено);
	Иначе		
		КомандаВыбратьДанныеПоКонтрагенту(Неопределено);
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчет);
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчетПолучатель);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСогласованоНажатие(Элемент)
	
	РаботаСДокументамиКлиентСервер.ПоказатьСкрытьКартуМаршрутаСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТребуетсяСогласованиеНажатие(Элемент)
	
	РаботаСДокументамиКлиентСервер.ПоказатьСкрытьКартуМаршрутаСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтмененоНажатие(Элемент)
	
	РаботаСДокументамиКлиентСервер.ПоказатьСкрытьКартуМаршрутаСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаСогласованияВыбор(Элемент)
			
	Если Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ТребуетсяПодтверждениеКлиентскогоОтдела")
		Или Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ПодтверждениеКлиентскогоОтдела") Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления" ) = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица") Тогда
					
			Если Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ПодтверждениеКлиентскогоОтдела") Тогда
				РаботаСДокументамиКлиент.ПоказатьОбъектБизнесПроцессаСогласованияПорученийНаВыводАктивов(Объект.Ссылка, Элемент.ТекущийЭлемент.Значение);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение требует подтверждения клиентского отдела.");	
			КонецЕсли;
			
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение не требует подтверждения клиентского отдела.");
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ЭтоПоручениеНаВыводЦенныхБумаг") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение на вывод ценных бумаг: Нет.");	
		
	Иначе	
		РаботаСДокументамиКлиент.ПоказатьОбъектБизнесПроцессаСогласованияПорученийНаВыводАктивов(Объект.Ссылка, Элемент.ТекущийЭлемент.Значение);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаИсполненияСПриИзменении(Элемент)
	
	РассчитатьДатуОкончанияИсполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПорученияПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	
	Если ЭтаФорма.ИсточникПоручения = 1 Тогда
		
		Объект.СпособПередачи   = Неопределено;
		Объект.ТипЗадолженности = Неопределено;
		Объект.Контрагент       = Неопределено;
		Объект.КонтрагентДоговорТекстом = Неопределено;
		ЭтаФорма.ВидПоручения   = 0; 
		
	ИначеЕсли ЭтаФорма.ИсточникПоручения = 2 Тогда
		
    	Объект.СпособПередачи   = ПредопределенноеЗначение("Перечисление.СпособыПередачиПоручений.ВнутренняяСистема");
		Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская");
		
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
			
			ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам = ПолучитьДанныеИзНастроекУчетаДоходовПоЦеннымБумагам(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Валюта);
			
			Объект.РасчетныйСчет = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.РасчетныйСчет;
			Объект.Валюта = ДанныеИзНастроекУчетаДоходовПоЦеннымБумагам.Валюта;
		
		КонецЕсли;
	
	КонецЕсли;
	
	РассчитатьДатуОкончанияИсполнения();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	Если Не ЗаполненТипЗадолженности() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская") Тогда
		СоответствиеРеквизитовИсполнителяИДокумента = Новый Структура("РасчетныйСчет", "РасчетныйСчетПолучатель");
	Иначе
		СоответствиеРеквизитовИсполнителяИДокумента = Неопределено;	
	КонецЕсли;
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, Ложь, СоответствиеРеквизитовИсполнителяИДокумента);
	
	ПроверитьВалютуРасчетныхСчетовНаСовпадение();

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьДанныеПоКонтрагенту(Команда)
	
	Если Не ЗаполненТипЗадолженности() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская") Тогда
		СоответствиеРеквизитовИсполнителяИДокумента = Новый Структура("РасчетныйСчет", "РасчетныйСчетПолучатель");
	Иначе
		СоответствиеРеквизитовИсполнителяИДокумента = Неопределено;	
	КонецЕсли;
	
	Если ЭтаФорма.ТипПередачи = 2 Тогда
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(ЭтаФорма, Объект.Контрагент, Ложь, СоответствиеРеквизитовИсполнителяИДокумента, Неопределено);	
	Иначе
		
		ЮрФизЛицоКлиента = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(ЭтаФорма, ЮрФизЛицоКлиента, ЭтаФорма.ТипПередачи = 1, СоответствиеРеквизитовИсполнителяИДокумента, ?(ЭтаФорма.ТипПередачи = 1, "КонтрагентДоговорТекстом", Неопределено));
		
	КонецЕсли;
	
	Если ЭтаФорма.ТипПередачи <> 1 Тогда
		УстановитьТекстКонтрагентаДоговора();
	КонецЕсли;
	
	ПроверитьВалютуРасчетныхСчетовНаСовпадение();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если Объект.Ссылка.Пустая() И Не Объект.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда
		Объект.ТипЗадолженности = Неопределено;	
		Объект.ВыводВсехАктивов = Ложь;
	КонецЕсли;
			
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
	
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);
		
	КонецЕсли;
	
	Если Объект.ВыводВсехАктивов Тогда
		ЭтаФорма.ВидПоручения = 3;
	ИначеЕсли Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская") Тогда
		ЭтаФорма.ВидПоручения = 1;
	ИначеЕсли Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская") Тогда
		ЭтаФорма.ВидПоручения = 2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СпособПередачи) Тогда	
		ЭтаФорма.ИсточникПоручения = ?(Объект.СпособПередачи = ПредопределенноеЗначение("Перечисление.СпособыПередачиПоручений.ВнутренняяСистема"), 2, 1);	
	Иначе
		ЭтаФорма.ИсточникПоручения = 1;	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьДекорацийСогласованияПорученияНаВыводАктивов(ЭтаФорма);

КонецПроцедуры 	

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;    
	Элементы      = Форма.Элементы;
	
	ВыводВсехАктивов    = ДанныеОбъекта.ВыводВсехАктивов;
	ПоручениеНаВвод     = ДанныеОбъекта.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская");
	ВнутреннееПоручение = (Форма.ИсточникПоручения = 2);
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	СобственныйСчетДУ = (ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный"));
	
	Элементы.ИсточникПоручения.Видимость            = РаботаСдокументами.ДействуетКонтрольПорученийВнутреннейСистемы(?(ЗначениеЗаполнено(ДанныеОбъекта.Дата), ДанныеОбъекта.Дата, ТекущаяДата()), ДанныеОбъекта.Организация);
	Элементы.ГруппаСуммаВалюта.Видимость            = Не ВыводВсехАктивов;			
	Элементы.ОписаниеДенежныхСредств.Видимость		= Не ПоручениеНаВвод;
	Элементы.КонтрагентПолучатель.Видимость			= Не (ПоручениеНаВвод Или ВнутреннееПоручение);
	Элементы.КонтрагентОтправитель.Видимость		= ПоручениеНаВвод;
	Элементы.КонтрагентДоговорПолучатель.Видимость	= Не (ПоручениеНаВвод Или ВнутреннееПоручение);
	Элементы.КонтрагентДоговорОтправитель.Видимость	= ПоручениеНаВвод;	
	
	Элементы.Основание.Видимость                    = ВнутреннееПоручение;
	Элементы.ТипПередачи.Видимость                  = Не (ВнутреннееПоручение Или СобственныйСчетДУ);
	Элементы.ВидПоручения.Видимость                 = Не ВнутреннееПоручение;
	Элементы.СпособПередачи.Видимость               = Не ВнутреннееПоручение;
	Элементы.ГруппаПолучатель.Видимость             = Не ВнутреннееПоручение;	
	Элементы.ГруппаВходящийДокумент.Видимость       = Не ВнутреннееПоручение;
	Элементы.ГруппаОписаниеНазначение.Видимость     = Не ВнутреннееПоручение;
	
	Элементы.КонтрагентПолучатель.ТолькоПросмотр  = Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
	Элементы.КонтрагентОтправитель.ТолькоПросмотр = Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
	
	Элементы.КонтрагентДоговорПолучатель.ТолькоПросмотр  = Форма.ТипПередачи = 0;
	Элементы.КонтрагентДоговорОтправитель.ТолькоПросмотр = Форма.ТипПередачи = 0;
	
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель.Видимость  = ПоручениеНаВвод;
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамОтправитель.Видимость = Не ПоручениеНаВвод Или ВнутреннееПоручение;
	Элементы.КомандаВыбратьДанныеПоКонтрагентуПолучатель.Видимость             = Не ПоручениеНаВвод;
	Элементы.КомандаВыбратьДанныеПоКонтрагентуОтправитель.Видимость            = ПоручениеНаВвод Или ВнутреннееПоручение;
	
	ТребуетсяПроверкаЗаполненияКонтрагента = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
	
	Элементы.КонтрагентПолучатель.АвтоОтметкаНезаполненного			= ТребуетсяПроверкаЗаполненияКонтрагента И Не ПоручениеНаВвод;
	Элементы.КонтрагентОтправитель.АвтоОтметкаНезаполненного		= ТребуетсяПроверкаЗаполненияКонтрагента И ПоручениеНаВвод;
	Элементы.КонтрагентДоговорПолучатель.АвтоОтметкаНезаполненного	= ТребуетсяПроверкаЗаполненияКонтрагента И Не ПоручениеНаВвод;
	Элементы.КонтрагентДоговорОтправитель.АвтоОтметкаНезаполненного	= ТребуетсяПроверкаЗаполненияКонтрагента И ПоручениеНаВвод;	
	Элементы.РасчетныйСчет.АвтоОтметкаНезаполненного				= ТребуетсяПроверкаЗаполненияКонтрагента И ПоручениеНаВвод;
	Элементы.РасчетныйСчетПолучатель.АвтоОтметкаНезаполненного		= ТребуетсяПроверкаЗаполненияКонтрагента И Не ПоручениеНаВвод;
		
	Элементы.КомандаВыбратьДанныеПоКонтрагентуОтправитель.Доступность            = Не Форма.ТолькоПросмотр;
	Элементы.КомандаВыбратьДанныеПоКонтрагентуПолучатель.Доступность             = Не Форма.ТолькоПросмотр;
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамОтправитель.Доступность = Не Форма.ТолькоПросмотр;
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствамПолучатель.Доступность  = Не Форма.ТолькоПросмотр;
		
	Элементы.ВидДвиженияДенежныхСредств.Видимость = (ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР") И Не (ПоручениеНаВвод Или ВнутреннееПоручение));
	
	ЕстьПраваНаСозданиеПодчиненныхДокументов = ПроверитьНаличиеПравНаСозданиеПодчиненныхДокументов();
	
	Если ЕстьПраваНаСозданиеПодчиненныхДокументов.ВводДенежныхСредств Тогда
		Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументВводДенежныхСредствСоздатьНаОсновании.Видимость = ПоручениеНаВвод;
	КонецЕсли;
	
	Если ЕстьПраваНаСозданиеПодчиненныхДокументов.ВыводДенежныхСредств Тогда
		Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументВыводДенежныхСредствСоздатьНаОсновании.Видимость = Не ПоручениеНаВвод;
	КонецЕсли;
	
	Если ЕстьПраваНаСозданиеПодчиненныхДокументов.ВыводЦенныхБумаг Тогда
		Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументВыводЦенныхБумагСоздатьНаОсновании.Видимость = ВыводВсехАктивов;
	КонецЕсли;
	
	Если ЕстьПраваНаСозданиеПодчиненныхДокументов.Оплата Тогда
		Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументОплатаСоздатьНаОсновании.Видимость = ВнутреннееПоручение И Не ЗначениеЗаполнено(ДанныеОбъекта.Основание);
	КонецЕсли;
			
	Элементы.ВидОперации.Видимость = (ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") И Не (ПоручениеНаВвод Или ВнутреннееПоручение));
	
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();

		ПутьКДаннымСкрываемыхПолей.Вставить("ВидДвиженияДенежныхСредств", "Объект.ВидДвиженияДенежныхСредств");
		ПутьКДаннымСкрываемыхПолей.Вставить("ОписаниеДенежныхСредств", "Объект.ОписаниеДенежныхСредств");
		ПутьКДаннымСкрываемыхПолей.Вставить("ВидОперации", "Объект.ВидОперации");
		ПутьКДаннымСкрываемыхПолей.Вставить("Основание", "Объект.Основание");
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаСуммаВалюта", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.Сумма, Объект.Валюта", ",", Истина, Истина));
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаВходящийДокумент", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.ДатаВходящегоДокумента, Объект.НомерВходящегоДокумента, Объект.ДатаИВремяПолучения, Объект.ЧерезАгента", ",", Истина, Истина));
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаОписаниеНазначение", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("Объект.ОписаниеДенежныхСредств, Объект.НазначениеПлатежа", ",", Истина, Истина)); 
		
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеПравНаСозданиеПодчиненныхДокументов()
	
	ПраваНаСозданиеПодчиненныхДокументов = Новый Структура();
	
	Для Каждого ДокументМД Из Метаданные.Документы Цикл
		
		Для Каждого ДокументОснованияМД Из ДокументМД.ВводитсяНаОсновании Цикл
			
			Если ДокументОснованияМД.Имя = "ПоручениеНаДвижениеДенежныхСредств" Тогда
				
				ПраваНаСозданиеПодчиненныхДокументов.Вставить(ДокументМД.Имя, ПравоДоступа("Добавление", ДокументМД)); 
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПраваНаСозданиеПодчиненныхДокументов;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекстКонтрагентаДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если ЗначениеЗаполнено(Объект.КонтрагентДоговорТекстом) Тогда
			Объект.КонтрагентДоговорТекстом = "";
		КонецЕсли;
		Возврат;
	КонецЕсли;                                      	
	                                                
	Объект.КонтрагентДоговорТекстом = РаботаСДокументами.ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(											
											Объект.Организация, 
											Объект.Контрагент, 
											?(Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская"), Объект.РасчетныйСчет, Объект.РасчетныйСчетПолучатель), 
											ЭтаФорма.ТипПередачи = 1, 
											Объект.Дата);	
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненТипЗадолженности()
	
	Если Не ЗначениеЗаполнено(Объект.ТипЗадолженности) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выбором расчетного счета укажите вид поручения",,,"Объект.ТипЗадолженности");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРасчетныеСчетаПриИзмененииКонтрагента()
	
	Если Не ЗаполненТипЗадолженности() Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемыйСчет = ?(Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская"), "РасчетныйСчет", "РасчетныйСчетПолучатель"); 
	Если Не ЗначениеЗаполнено(Объект[ПроверяемыйСчет]) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект[ПроверяемыйСчет]) Тогда
		Объект[ПроверяемыйСчет] = "";
		Объект.КонтрагентДоговорТекстом = "";
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект[ПроверяемыйСчет], "ЮрФизЛицо") <> Объект.Контрагент Тогда
		Объект[ПроверяемыйСчет] = "";
		Объект.КонтрагентДоговорТекстом = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВалютуРасчетныхСчетовНаСовпадение()
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
			ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");			
							
			Если ВалютаРасчетногоСчетаПолучателя <> ВалютаРасчетногоСчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта " + ВалютаРасчетногоСчетаПолучателя + " расчетного счета получателя " + Объект.РасчетныйСчетПолучатель + " отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета отправителя.",,, "Объект.РасчетныйСчетПолучатель");
				Объект.РасчетныйСчетПолучатель = Неопределено;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчета Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчета + " из расчетного счета.");
							
			КонецЕсли;
			
			Объект.Валюта = ВалютаРасчетногоСчета;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.РасчетныйСчетПолучатель) Тогда
		
		ВалютаРасчетногоСчетаПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетПолучатель, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.Валюта) И Объект.Валюта <> ВалютаРасчетногоСчетаПолучателя Тогда
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчетаПолучателя + " из расчетного счета получателя.");
							
		КонецЕсли;
			
		Объект.Валюта = ВалютаРасчетногоСчетаПолучателя;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДатуОкончанияИсполнения()
	
	Если ЭтаФорма.ИсточникПоручения = 2 Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ДатаИсполненияС) Тогда
			Объект.ДатаИсполненияС = ТекущаяДата();
		КонецЕсли;
		
		Объект.ДатаИсполненияПо = ПолучитьДатуПлюсПятьРабочихДней(Объект.ДатаИсполненияС);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаИсполненияС)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоуправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") Тогда
		
			// Добавляем 30 календарных дней
			Объект.ДатаИсполненияПо = Объект.ДатаИсполненияС + 30 * 24 * 60 * 60;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуПлюсПятьРабочихДней(Дата)

	Возврат Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, Дата, 5); 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеИзНастроекУчетаДоходовПоЦеннымБумагам(Дата, Организация, СчетДоверительногоУправления, Валюта)
	
	ДанныеНастроек = Новый Структура("РасчетныйСчет, Валюта",, Валюта);
	
	Дата = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	Таблица.Колонки.Добавить("ВалютаОплаты", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.СчетДоверительногоУправления = СчетДоверительногоУправления;
	НоваяСтрока.ВалютаОплаты = ?(ЗначениеЗаполнено(Валюта), Валюта, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета"));
	
	ТаблицаДанных = РегистрыСведений.НастройкиУчетаДоходовПоЦеннымБумагам.ПолучитьЗначенияНастроекУчетаДоходовПоЦеннымБумагам(Таблица, Дата, Организация);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.РасчетныйСчет) Тогда
			
			ДанныеНастроек.РасчетныйСчет = СтрокаТаблицы.РасчетныйСчет;
			ДанныеНастроек.Валюта = НоваяСтрока.ВалютаОплаты; 
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеНастроек;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
